#+title: Reporti: TI-Inspired LaTeX Template.
#+latex_class_options: [english]
#+latex_class: reporti
#+options: toc:nil author:nil date:nil title:nil ::t prop:nil ^:t
#+language: en
#+PROPERTY: header-args :results silent :tangle ./reporti.cls 

#+LATEX:\subtitle{LaTeX Template}
#+LATEX:\author{Rhyloo - \href{mailto:jorge2@uma.es}{jorge2@uma.es}}
#+LATEX:\contact{\href{mailto :jorge2@uma.es}{Feedback about the documentation.}}
#+LATEX:\logo{rhyloo_solutions_horizontal.pdf}

#+LATEX:\type{README}
#+LATEX:\projectcode{REPORTI_DOC_TEMPLATE_v0.0}

#+LATEX:\summary{This document pretend to be the documentation of Reporti: A Texas-Instruments inspired LaTeX template.}

#+LATEX:\notes{Just copy it and modify under MIT.}

#+LATEX:\cover[width=1.35\textwidth][next]

#+begin_export markdown
> [!NOTE]
> This is a note.
#+end_export

* How to use
If you are planning to use this template with LaTeX with linux download ~reporti.csl~ and put it in the path ....

#+begin_src bash :results drawer replace :exports both :tangle no 
find -L /home -samefile ./../Reporti/reporti.cls # 
#+end_src

#+RESULTS:
:results:
/home/rhyloo/Documents/LaTeX/Reporti/reporti.cls
/home/rhyloo/texmf/tex/latex/local/reporti.cls
/home/rhyloo/.emacs.d/reporti.cls
/home/rhyloo/snap/languagetool/45/Documents/LaTeX/Reporti/reporti.cls
/home/rhyloo/snap/languagetool/current/Documents/LaTeX/Reporti/reporti.cls
:end:

